Reports/ПрайсЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПрайсЛист</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидНоменклатурыПотолки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрайсЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКартинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_НесколькоВидовЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьАрхивныеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потолки_ГруппировкаПоФактуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потолки_ГруппировкаПоГруппеФактур</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсТоварыМатериалыУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсПотолки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсПроизводственныеУслугиНаПотолки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсОтрезы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсПроизводственныеУслугиНаОтрезы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потолки_ПоказыватьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потолки_ПоказыватьАрхивныеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеУслуги_ПоказыватьАрхивныеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрезы_ПоказыватьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрезы_ПоказыватьАрхивныеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрезы_ГруппировкаПоФактуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрезы_ГруппировкаПоГруппеФактур</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеУслугиОтрезы_ПоказыватьАрхивныеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_ОтборГруппНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_ОтборГруппФактуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Архивный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыИндивидуальныхЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ЭлектронноеПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ПрайсЛист/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Валюта = Константы.ВалютаУчета.Получить();
	Отчет.Дата = ТекущаяДатаСеанса();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетМетаданные = ОтчетОбъект.Метаданные();
	ОтчетПолноеИмя  = ОтчетМетаданные.ПолноеИмя();
	ОтчетИмя = ОтчетМетаданные.Имя;
	
	ТЗ_ПорядокВидовЦен = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
								"ОтчетПрайсЛист",
								"ПорядокВидовЦен");
	
	//++ #13578 пока убрано
	//ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	//ОграничиватьПереченьДоступныхВидовЦен = ТекущийПользователь.ОграничиватьПереченьДоступныхВидовЦен;
	
	//Если ОграничиватьПереченьДоступныхВидовЦен Тогда
	//	Элементы.ВидЦен.СписокВыбора.Очистить();
	//	Элементы.ВидЦен.РежимВыбораИзСписка = Истина;
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	//	Запрос.УстановитьПараметр("ОграничиватьПереченьДоступныхВидовЦен", ОграничиватьПереченьДоступныхВидовЦен);
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ДоступныеВидыЦен.ВидЦены КАК Ссылка
	//	|ИЗ
	//	|	Справочник.Пользователи.ДоступныеВидыЦен КАК ДоступныеВидыЦен
	//	|ГДЕ
	//	|	ДоступныеВидыЦен.Ссылка = &ТекущийПользователь";
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Элементы.ВидЦен.СписокВыбора.Добавить(Выборка.Ссылка);	
	//	КонецЦикла;	
	//КонецЕсли;
	//-- #13578
	
	//++ #13646 переделано на дерево
	
	//Отчет.ОтборВидыЦен.Очистить();
	//Запрос = Новый Запрос;
	////Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	////Запрос.УстановитьПараметр("ОграничиватьПереченьДоступныхВидовЦен", ОграничиватьПереченьДоступныхВидовЦен);
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВидыЦен.Ссылка КАК Ссылка,
	//|	999 КАК Порядок,
	//|	ЛОЖЬ КАК Выбрать,
	////++ #10575
	//|	ВидыЦен.Архивный КАК Архивный
	////-- #10575
	//|ИЗ
	//|	Справочник.ВидыЦен КАК ВидыЦен
	////++ #13578 пока убрано
	////|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.ДоступныеВидыЦен КАК ДоступныеВидыЦен
	////|		ПО (ДоступныеВидыЦен.Ссылка = &ТекущийПользователь)
	////|			И (ДоступныеВидыЦен.ВидЦены = ВидыЦен.Ссылка)
	////
	//|ГДЕ
	//|	НЕ ВидыЦен.ЭтоГруппа
	////|	ВЫБОР
	////|			КОГДА &ОграничиватьПереченьДоступныхВидовЦен
	////|				ТОГДА НЕ ДоступныеВидыЦен.Ссылка ЕСТЬ NULL
	////|			ИНАЧЕ ИСТИНА
	////|		КОНЕЦ
	////-- #13578
	//|";
	//
	//ТЗ_ВидыЦен = Запрос.Выполнить().Выгрузить();
	//
	//Если ТЗ_ПорядокВидовЦен <> Неопределено Тогда
	//	Для каждого ЭлементТЗ из ТЗ_ПорядокВидовЦен Цикл
	//		Отбор = Новый Структура("Ссылка", ЭлементТЗ.ВидЦены);
	//		НайденныеСтроки = ТЗ_ВидыЦен.НайтиСтроки(Отбор);
	//		Если НайденныеСтроки.Количество() > 0 Тогда
	//			Попытка
	//				НайденныеСтроки[0].Порядок = ЭлементТЗ.ПорядокЦены;
	//				НайденныеСтроки[0].Выбрать = ЭлементТЗ.Выбрать;
	//			Исключение
	//			КонецПопытки;
	//		КонецЕсли;
	//	КонецЦикла;
	//	ТЗ_ВидыЦен.Сортировать("Порядок");		
	//КонецЕсли;
	//
	//Для каждого ЭлементТЗ из ТЗ_ВидыЦен Цикл
	//	НоваяСтрока = Отчет.ОтборВидыЦен.Добавить();
	//	НоваяСтрока.ВидЦены = ЭлементТЗ.Ссылка;
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементТЗ, "Выбрать, Архивный");
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНастроекЦен", ?(ТЗ_ПорядокВидовЦен = Неопределено, ПустаяТаблицаНастроекЦен(), ТЗ_ПорядокВидовЦен)); 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНастроекЦен.ПорядокЦены КАК Порядок,
	|	ТаблицаНастроекЦен.Выбрать КАК Выбрать,
	|	ТаблицаНастроекЦен.ВидЦены КАК Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаНастроекЦен КАК ТаблицаНастроекЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК Ссылка,
	|	ВидыЦен.ЭтоГруппа КАК ЭтоГруппа,
	|	ВидыЦен.Архивный КАК Архивный,
	|	ЕСТЬNULL(ВТ.Порядок, 999) КАК Порядок,
	|	ЕСТЬNULL(ВТ.Выбрать, ЛОЖЬ) КАК Выбрать
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО (ВТ.Ссылка = ВидыЦен.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Дерево.Строки.Сортировать("ЭтоГруппа УБЫВ, Порядок", Истина);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоВидовЦен");
	//--
	
	//++17158
	//Элементы.ГруппаИндивидуальныеЦены.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены");
	//УправлениеВидимостьюПоИндивидуальнымЦенам();
	//--17158
	
	ДополнительныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
								"ОтчетПрайсЛист",
								"ДополнительныеНастройки");
	
	НастройкиКомпоновкиНоменклатуры = Неопределено;
	Если ТипЗнч(ДополнительныеНастройки) = Тип("Структура") Тогда
		Если ДополнительныеНастройки.Свойство("ОтборНоменклатура") Тогда
			НастройкиКомпоновкиНоменклатуры = ДополнительныеНастройки.ОтборНоменклатура.Получить();
		КонецЕсли;
	КонецЕсли;
		
	//#3642
	СКДНоменклатура = ОтчетОбъект.ПолучитьМакет("СКДНоменклатура");
	ИнициализироватьКомпоновщикНастроек(СКДНоменклатура, КомпоновщикНастроекНоменклатура, НастройкиКомпоновкиНоменклатуры, Истина);
	
	СКДФактура = ОтчетОбъект.ПолучитьМакет("СКДФактура");
	ИнициализироватьКомпоновщикНастроек(СКДФактура, КомпоновщикНастроекФактура);
	
	УстановитьУсловноеОформление();
	Элементы.ОтборВидыЦен.ОтборСтрок = Новый ФиксированнаяСтруктура("Архивный", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УправлениеВидимостьюПоВидуЦен();	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	//ТЗ_ПорядокВидовЦен = Отчет.ОтборВидыЦен.Выгрузить(, "НомерСтроки, Выбрать, ВидЦены");
	
	ТЗ_ПорядокВидовЦен = ПустаяТаблицаНастроекЦен();
	Счетчик = 1;
	ЗапомнитьВыборВидовЦенРекурсивно(ДеревоВидовЦен.ПолучитьЭлементы(), ТЗ_ПорядокВидовЦен, Счетчик);
	
	Если ТЗ_ПорядокВидовЦен.Количество() > 0 Тогда
		//ТЗ_ПорядокВидовЦен.Колонки.НомерСтроки.Имя = "ПорядокЦены";
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"ОтчетПрайсЛист",
			"ПорядокВидовЦен",
			ТЗ_ПорядокВидовЦен);
	КонецЕсли;
	
	ДополнительныеНастройки = Новый Структура;
	ДополнительныеНастройки.Вставить("ОтборНоменклатура", Новый ХранилищеЗначения(КомпоновщикНастроекНоменклатура.ПолучитьНастройки()));
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"ОтчетПрайсЛист",
			"ДополнительныеНастройки",
			ДополнительныеНастройки);	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//++17158
	ОбновитьЭлементыФормы();
	
	// №6999 добавлено присвоение значения по умолчанию
	//Если НЕ ЗначениеЗаполнено(Отчет.ВидНоменклатурыПотолки) Тогда
	//	Отчет.УДАЛИТЬ_ВидНоменклатурыПотолки = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок");
	//КонецЕсли;
	//--17158
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	Если НЕ ПраваПользователей.ВидЦенДоступенПользователю(Отчет.ВидЦен) Тогда
		Отчет.ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Отчет.ДоговорКонтрагента = Отчет.Контрагент.ОсновнойДоговор;
КонецПроцедуры

#КонецОбласти

#Область ФормированиеОтчета

&НаКлиенте
Процедура Сформировать(Команда)
	
	// №6999 переделано на вызов стандартной проверки заполнения
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	//Результат = Новый ТабличныйДокумент;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПрайсЛист;
	
	ЗаголовокВыведен = Ложь;
	
	РезультатФоновогоЗадания = ФоновоеЗаданиеЗапустить();
	Если РезультатФоновогоЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
	ИначеЕсли РезультатФоновогоЗадания.Статус <> "Выполняется" Тогда 
		//ОперацииПослеФормирования();
	Иначе
		Обработчик = Новый ОписаниеОповещения("ФоновоеЗаданиеВыполнено", ЭтотОбъект, Истина);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗапустить()
	
	ТабличныйДокумент.Очистить();
	
	Если Отчет.Дата = Дата(1,1,1) Тогда
		Отчет.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СписокВидовЦен = Новый СписокЗначений;	
	ВыбратьВидыЦенРекурсивно(ДеревоВидовЦен.ПолучитьЭлементы(), СписокВидовЦен);
	
	// Запуск фонового задания
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	СКДНоменклатура = ТекОбъект.ПолучитьМакет("СКДНоменклатура");
	СКДФактура 		= ТекОбъект.ПолучитьМакет("СКДФактура");
	СписокДляОтбораНоменклатуры = ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, КомпоновщикНастроекНоменклатура, "Номенклатура");
	СписокДляОтбораФактур 		= ПолучитьМассивСсылокПоОтбору(СКДФактура, КомпоновщикНастроекФактура, "Фактура");
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ТаблицаПоказателей", ТаблицаТекущихПоказателей.Выгрузить());
	//СтруктураПараметров.Вставить("Период", Период);	
	
	ПараметрыФормированияОтчета = Новый Структура;
	
	ПараметрыФормированияОтчета.Вставить("Организация", Отчет.Организация);
	ПараметрыФормированияОтчета.Вставить("Дата", Отчет.Дата);
	ПараметрыФормированияОтчета.Вставить("Валюта", Отчет.Валюта);
	
	ПараметрыФормированияОтчета.Вставить("ПрайсТоварыМатериалыУслуги", Отчет.ПрайсТоварыМатериалыУслуги);	
	ПараметрыФормированияОтчета.Вставить("ПрайсПотолки", Отчет.ПрайсПотолки);
	ПараметрыФормированияОтчета.Вставить("ПрайсПроизводственныеУслугиНаПотолки", Отчет.ПрайсПроизводственныеУслугиНаПотолки);
	ПараметрыФормированияОтчета.Вставить("ПрайсОтрезы", Отчет.ПрайсОтрезы);
	ПараметрыФормированияОтчета.Вставить("ПрайсПроизводственныеУслугиНаОтрезы", Отчет.ПрайсПроизводственныеУслугиНаОтрезы);
	
	ПараметрыФормированияОтчета.Вставить("ПоказыватьНулевыеЦены", 		Отчет.ПоказыватьНулевыеЦены);
	ПараметрыФормированияОтчета.Вставить("ПоказыватьАрхивныеПозиции", 	Отчет.ПоказыватьАрхивныеПозиции);
	ПараметрыФормированияОтчета.Вставить("Потолки_ПоказыватьНулевыеЦены", 		Отчет.Потолки_ПоказыватьНулевыеЦены);
	ПараметрыФормированияОтчета.Вставить("Потолки_ПоказыватьАрхивныеПозиции", 		Отчет.Потолки_ПоказыватьАрхивныеПозиции);
	ПараметрыФормированияОтчета.Вставить("ПроизводственныеУслуги_ПоказыватьАрхивныеПозиции", 		Отчет.ПроизводственныеУслуги_ПоказыватьАрхивныеПозиции);
	ПараметрыФормированияОтчета.Вставить("ПроизводственныеУслугиОтрезы_ПоказыватьАрхивныеПозиции", 	Отчет.ПроизводственныеУслугиОтрезы_ПоказыватьАрхивныеПозиции);
	ПараметрыФормированияОтчета.Вставить("Отрезы_ПоказыватьНулевыеЦены", 		Отчет.Отрезы_ПоказыватьНулевыеЦены);
	ПараметрыФормированияОтчета.Вставить("Отрезы_ПоказыватьАрхивныеПозиции", 	Отчет.Отрезы_ПоказыватьАрхивныеПозиции);
	
	ПараметрыФормированияОтчета.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
	ПараметрыФормированияОтчета.Вставить("СписокДляОтбораФактур", 		СписокДляОтбораФактур);
	
	ПараметрыФормированияОтчета.Вставить("Потолки_ГруппировкаПоФактуре", 		Отчет.Потолки_ГруппировкаПоФактуре);
	ПараметрыФормированияОтчета.Вставить("Потолки_ГруппировкаПоГруппеФактур", 	Отчет.Потолки_ГруппировкаПоГруппеФактур);
	ПараметрыФормированияОтчета.Вставить("Отрезы_ГруппировкаПоФактуре", 		Отчет.Отрезы_ГруппировкаПоФактуре);
	ПараметрыФормированияОтчета.Вставить("Отрезы_ГруппировкаПоГруппеФактур", 	Отчет.Отрезы_ГруппировкаПоГруппеФактур);
		
	ПараметрыФормированияОтчета.Вставить("ВыводитьКартинки", 			Отчет.ВыводитьКартинки);
	ПараметрыФормированияОтчета.Вставить("СписокВидовЦен", 				СписокВидовЦен);
	ПараметрыФормированияОтчета.Вставить("ВидыИндивидуальныхЦен", 		Отчет.ВидыИндивидуальныхЦен.Выгрузить());
		
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяМетода", "СформироватьОтчет");
	ПараметрыЗадания.Вставить("ИмяОтчета", ОтчетИмя);
	//ПараметрыФормированияОтчета.Вставить("КлючВарианта", КлючТекущегоВарианта);
	ПараметрыЗадания.Вставить("ЭтоВнешнийОтчет", Ложь);
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыФормированияОтчета);
	
	ИнформацияОбОшибке = Неопределено;
	Попытка
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
		ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОтчета";
		
		РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
			ВыполняемыйМетод,
			ПараметрыЗадания,
			ПараметрыВыполнения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если ИнформацияОбОшибке <> Неопределено Тогда
		ПоказатьОшибкиФормирования(ПоляПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецЕсли;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		
		ФоновоеЗаданиеЗагрузитьРезультат(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		
		ПоказатьОшибкиФормирования(РезультатФоновогоЗадания);
		
	ИначеЕсли РезультатФоновогоЗадания.Статус = "Выполняется" Тогда
		
		ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
		ОтображениеСостояния.Видимость                      = Истина;
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
		ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
		
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеВыполнено(Результат, ЗагрузитьРезультатФормированияОтчета) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если Результат.Статус = "Выполнено" Тогда 
		ФоновоеЗаданиеЗагрузитьРезультат(Результат);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьОшибкиФормирования(Результат);
	КонецЕсли;
	
	//ОперацииПослеФормирования();
	
КонецПроцедуры

&НаСервере
Процедура ФоновоеЗаданиеЗагрузитьРезультат(Знач РезультатФоновогоЗадания)
	
	Если НЕ ЭтоАдресВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата) Тогда
		Возврат;
	КонецЕсли; 
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
	//НастройкиПечатиСохранить();
	ТабличныйДокумент = РезультатФормирования.ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	//НастройкиПечатиВосстановить();
	
	//ТаблицаДанных.Загрузить(РезультатФормирования.ТаблицаДанных); //для расшифровки
		
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = "";
	
	УдалитьИзВременногоХранилища(РезультатФоновогоЗадания.АдресРезультата);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПредставлениеОшибки(Знач ИнформацияОбОшибке)
	
	Результат = Новый Структура;
	КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	Если ПустаяСтрока(КраткоеПредставлениеОшибки) Тогда
		КраткоеПредставлениеОшибки = ПодробноеПредставлениеОшибки;
	КонецЕсли;
	Результат.Вставить("КраткоеПредставлениеОшибки", КраткоеПредставлениеОшибки);
	Результат.Вставить("ПодробноеПредставлениеОшибки", ПодробноеПредставлениеОшибки);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоказатьОшибкиФормирования(Знач ДанныеОшибки)
	
	Если ТипЗнч(ДанныеОшибки) = Тип("Структура") Тогда
		КраткоеПредставлениеОшибки = ДанныеОшибки.КраткоеПредставлениеОшибки;
		ПодробноеПредставлениеОшибки = ДанныеОшибки.ПодробноеПредставлениеОшибки;
	Иначе
		КраткоеПредставлениеОшибки = ДанныеОшибки;
		ПодробноеПредставлениеОшибки = "";
	КонецЕсли;
	
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = КраткоеПредставлениеОшибки;
	
	Если ПустаяСтрока(ПодробноеПредставлениеОшибки) Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивСсылокПоОтбору(МакетСКД, КомпоновщикНастроек, НаименованиеКолонки)
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТЗ.ВыгрузитьКолонку(НаименованиеКолонки);
	 	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьНаПечать(Команда)
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПрайсЛист");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "ПрайсЛист");
	ПечатнаяФорма.СинонимМакета = "ПрайсЛист";
	ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "ПрайсЛист";
	
	ОбластиОбъектов = Новый СписокЗначений;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Если Отчет.Организация.Пустая() Тогда 
		ПоказатьПредупреждение(,"Не указана организация");
	Иначе
		//Если Отчет.ВыводитьКартинки Тогда 
		//	
		//	ПоказатьПредупреждение(, "Файл прайс-листа с картинками будет большим и не сможет быть отправлен по почте.
		//								|Сформируйте прайс без картинок и повторите отправку по почте");
		//	Элементы.ГруппаОтправить.Доступность = Ложь;
		//	
		//Иначе
			
			НовоеПисьмо = ОтправитьПоПочтеНаСервере();
			
			НазваниеОрганизации = СтрЗаменить(Отчет.Организация,"""","");
			ИмяФайла = КаталогВременныхФайлов() + "Прайс-лист от " + Формат(Отчет.Дата,"ДЛФ=Д") + " компании " + НазваниеОрганизации + ".xls";
			ТабличныйДокумент.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
			ИмяБезРасширения = КаталогВременныхФайлов() + "Прайс-лист от " + Формат(Отчет.Дата,"ДЛФ=Д") + " компании " + НазваниеОрганизации; 
			Расширение = ".xls";
			
			ВложитьФайлНаСервере(НовоеПисьмо,ИмяБезРасширения,Расширение, ОбщийМодуль.Сериализовать(Новый ДвоичныеДанные(ИмяФайла)));
			
			ПараметрыНовойФормы = Новый Структура("Ключ", НовоеПисьмо);
			ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",ПараметрыНовойФормы);
			
		//КонецЕсли;
	КонецЕсли;   	
КонецПроцедуры

&НаСервере
Функция ОтправитьПоПочтеНаСервере()
	
	ЗаголовокНовогоПисьма = "Прайс-лист от " + Формат(Отчет.Дата,"ДЛФ=Д") + " компании " + Отчет.Организация.Наименование;
	
	ТекстПисьма = "Добрый день!
	| Высылаем вам прайс-лист.";	
	
	НовоеПисьмо = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо(ЗаголовокНовогоПисьма, , ТекстПисьма);
	
	Возврат НовоеПисьмо;				
				
КонецФункции

#КонецОбласти

#Область ВкладкаВидыЦен

&НаКлиенте
Процедура КомандаВидыЦенВыбратьВсе(Команда)
	
	//#13646
	//Для Каждого ТекЦена Из Отчет.ОтборВидыЦен Цикл
	//	ТекЦена.Выбрать = Истина;
	//КонецЦикла;
	ИзменитьПризнакВыбрать(ДеревоВидовЦен.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидыЦенОтменитьВыборВсех(Команда)
	
	//#13646
	//Для Каждого ТекЦена Из Отчет.ОтборВидыЦен Цикл
	//	ТекЦена.Выбрать = Ложь;
	//КонецЦикла;
	ИзменитьПризнакВыбрать(ДеревоВидовЦен.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПризнакВыбратьДляАрхивныхПозиций(ЭлементыДерева)
	
	Для каждого ЭлементДерева из ЭлементыДерева Цикл
		Если ЭлементДерева.Архивный Тогда
			ЭлементДерева.Выбрать = Ложь;
		КонецЕсли;
		СнятьПризнакВыбратьДляАрхивныхПозиций(ЭлементДерева.ПолучитьЭлементы())
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПризнакВыбрать(ЭлементыДерева, ПризнакВыбрать)
	
	Для каждого ЭлементДерева из ЭлементыДерева Цикл
		Если ЭлементДерева.Архивный И НЕ ПоказыватьАрхивныеВидыЦен Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементДерева.Выбрать = ПризнакВыбрать;	
		ИзменитьПризнакВыбрать(ЭлементДерева.ПолучитьЭлементы(), ПризнакВыбрать)
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВидыЦен(Команда)
	
	УстановкаЦенКлиент.РазвернутьДерево(Элементы, ДеревоВидовЦен, "ДеревоВидовЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВидыЦен(Команда)
	
	УстановкаЦенКлиент.СвернутьДерево(Элементы, ДеревоВидовЦен, "ДеревоВидовЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАрхивныеЦены(Команда)
	
	// #10575
	ПоказыватьАрхивныеВидыЦен = НЕ ПоказыватьАрхивныеВидыЦен;
	Элементы.ОтборВидыЦенПоказыватьАрхивныеЦены.Пометка = НЕ Элементы.ОтборВидыЦенПоказыватьАрхивныеЦены.Пометка;
	Если НЕ ПоказыватьАрхивныеВидыЦен Тогда
		//#13646
		//Для каждого СтрокаТЧ из Отчет.ОтборВидыЦен Цикл
		//	Если СтрокаТЧ.Архивный И СтрокаТЧ.Выбрать Тогда
		//		СтрокаТЧ.Выбрать = Ложь;
		//	КонецЕсли;
		//КонецЦикла;
		//
		//Элементы.ОтборВидыЦен.ОтборСтрок = Новый ФиксированнаяСтруктура("Архивный", Ложь);
		
		СнятьПризнакВыбратьДляАрхивныхПозиций(ДеревоВидовЦен.ПолучитьЭлементы());
	Иначе
		//Элементы.ОтборВидыЦен.ОтборСтрок = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовЦенВыбратьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоВидовЦен.ТекущиеДанные;
	
	РодительскаяСтрока = ТекущиеДанные.ПолучитьРодителя();	
	Если НЕ РодительскаяСтрока = Неопределено Тогда
		ВсеУстановлены = Истина;
		Для каждого ЭлементДерева из РодительскаяСтрока.ПолучитьЭлементы() Цикл
			Если НЕ ЭлементДерева.Выбрать Тогда
				ВсеУстановлены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		РодительскаяСтрока.Выбрать = ВсеУстановлены;
	КонецЕсли;
	
	ИзменитьПризнакВыбрать(ТекущиеДанные.ПолучитьЭлементы(), ТекущиеДанные.Выбрать);
		
КонецПроцедуры

&НаСервере
Процедура ВыбратьВидыЦенРекурсивно(ЭлементыДерева, СписокВидовЦен)
	
	Для каждого ЭлементДерева из ЭлементыДерева Цикл
		Если ЭлементДерева.Выбрать И НЕ ЭлементДерева.ЭтоГруппа Тогда
			СписокВидовЦен.Добавить(ЭлементДерева.Ссылка);
		КонецЕсли;
		
		ВыбратьВидыЦенРекурсивно(ЭлементДерева.ПолучитьЭлементы(), СписокВидовЦен)
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьВыборВидовЦенРекурсивно(ЭлементыДерева, ТаблицаВидов, Счетчик)
	
	Для каждого ЭлементДерева из ЭлементыДерева Цикл
		НоваяСтрока = ТаблицаВидов.Добавить();
		НоваяСтрока.Выбрать = ЭлементДерева.Выбрать;
		НоваяСтрока.ПорядокЦены = Счетчик;
		НоваяСтрока.ВидЦены = ЭлементДерева.Ссылка;
		
		Счетчик = Счетчик + 1;
		
		ЗапомнитьВыборВидовЦенРекурсивно(ЭлементДерева.ПолучитьЭлементы(), ТаблицаВидов, Счетчик)
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// #10575 оформление архивных видов цен
	//ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
	//	УсловноеОформление.Элементы, "ОтборВидыЦен", 
	//	Новый ПолеКомпоновкиДанных("Отчет.ОтборВидыЦен.Архивный"), ВидСравненияКомпоновкиДанных.Равно, Истина,
	//	ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет
	//);
	
	//#13646
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформление.Элементы, "ДеревоВидовЦен", 
		Новый ПолеКомпоновкиДанных("ДеревоВидовЦен.Архивный"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет
	);
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоВидовЦенВыбрать");
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоВидовЦенВидЦены");
	
	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоВидовЦен.Архивный");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоказыватьАрхивныеВидыЦен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

КонецПроцедуры

&НаСервере
Функция ПустаяТаблицаНастроекЦен()
	
	ТЗ_ПорядокВидовЦен = Новый ТаблицаЗначений;
	ТЗ_ПорядокВидовЦен.Колонки.Добавить("ПорядокЦены", Новый ОписаниеТипов("Число"));
	ТЗ_ПорядокВидовЦен.Колонки.Добавить("Выбрать", Новый ОписаниеТипов("Булево"));
	ТЗ_ПорядокВидовЦен.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	
	Возврат ТЗ_ПорядокВидовЦен;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек(МакетСКД, КомпоновщикНастроек, НастройкиКомпоновки = Неопределено, МакетНоменклатуры = Ложь)
	
	АдресВХ = ПоместитьВоВременноеХранилище(МакетСКД, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);
	
	Если НастройкиКомпоновки = Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);
	Иначе
		
		//Если МакетНоменклатуры Тогда
		//	НастройкиКомпоновки.Выбор.Элементы.Очистить();
		//	
		//	ВыбранноеПоле               = НастройкиКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		//	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("Номенклатура");
		//	ВыбранноеПоле.Использование = Истина;
		//	
		//	ВыбранноеПоле               = НастройкиКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		//	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных("ХарактеристикаНоменклатуры");
		//	ВыбранноеПоле.Использование = Истина;
		//КонецЕсли;	
	
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция НайтиЦену(Выборка, СписокВидовЦен, НомерЦеныВСписке, ТаблицаСЦенами)
	
	ОтборЦены = Новый Структура;
	ОтборЦены.Вставить("Номенклатура", 	Выборка.Номенклатура);
	ОтборЦены.Вставить("ЕдИзм",			Выборка.ЕдИзм);
	ОтборЦены.Вставить("ВидЦены",		СписокВидовЦен.Получить(НомерЦеныВСписке).Значение);
	ОтборЦены.Вставить("ХарактеристикаНоменклатуры",Выборка.ХарактеристикаНоменклатуры);
	НайденныеСтроки = ТаблицаСЦенами.НайтиСтроки(ОтборЦены);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].Цена;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ВложитьФайлНаСервере(Ссылка, ИмяФайла, Расширение, Данные)
	РаботаСЭлектроннойПочтой.СохранитьВложение(Ссылка, ИмяФайла, Расширение, Данные);
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюПоВидуЦен()
	
	//Элементы.ГруппаОтборВидыЦен.Видимость = Отчет.НесколькоВидовЦен;
	//Элементы.ВидЦен.Видимость = НЕ Отчет.НесколькоВидовЦен;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюПоИндивидуальнымЦенам()
	
	Элементы.ГруппаИндивидуальныеЦеныКонтрагент.Видимость = Отчет.ИндивидуальныеЦены;
	//Элементы.НесколькоВидовЦен.Видимость = НЕ Отчет.ИндивидуальныеЦены;
	Если Отчет.ИндивидуальныеЦены Тогда
		//Отчет.НесколькоВидовЦен = Ложь;
		УправлениеВидимостьюПоВидуЦен();
	КонецЕсли;
	
КонецПроцедуры
	
//&НаСервере
//Процедура ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров)
//	
//	Если Отчет.Дата = Дата(1,1,1) Тогда
//		Отчет.Дата = ТекущаяДатаСеанса();
//	КонецЕсли;
//	
//	//Если НЕ Отчет.НесколькоВидовЦен Тогда
//	//	СписокВидовЦен.Добавить(Отчет.ВидЦен);
//	//Иначе
//		//#13646
//		//Для Каждого ТекущаяСтрока Из Отчет.ОтборВидыЦен Цикл
//		//	Если ТекущаяСтрока.Выбрать Тогда
//		//		СписокВидовЦен.Добавить(ТекущаяСтрока.ВидЦены);
//		//	КонецЕсли;
//		//КонецЦикла;
//		ВыбратьВидыЦенРекурсивно(ДеревоВидовЦен.ПолучитьЭлементы(), СписокВидовЦен);
//	//КонецЕсли;
//	
//	ТекОбъект = РеквизитФормыВЗначение("Отчет");
//	СКДНоменклатура = ТекОбъект.ПолучитьМакет("СКДНоменклатура");
//	СКДФактура 		= ТекОбъект.ПолучитьМакет("СКДФактура");
//	СписокДляОтбораНоменклатуры = ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, КомпоновщикНастроекНоменклатура, "Номенклатура");
//	СписокДляОтбораФактур 		= ПолучитьМассивСсылокПоОтбору(СКДФактура, КомпоновщикНастроекФактура, "Фактура");
//	
//	//СписокДляОтбораНоменклатуры = Новый СписокЗначений;
//	//Для Каждого ТекущаяСтрока Из Отчет.ОтборГруппНоменклатуры Цикл
//	//	СписокДляОтбораНоменклатуры.Добавить(ТекущаяСтрока.Номенклатура);
//	//КонецЦикла;
//	Если СписокДляОтбораНоменклатуры.Количество() = 0 Тогда
//		СписокДляОтбораНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
//	КонецЕсли;
//	
//	//СписокДляОтбораФактур = Новый СписокЗначений;
//	//Для Каждого ТекущаяСтрока Из Отчет.ОтборГруппФактуры Цикл
//	//	СписокДляОтбораФактур.Добавить(ТекущаяСтрока.Фактура);
//	//КонецЦикла;
//	//Если СписокДляОтбораФактур.Количество() = 0 Тогда
//	//	СписокДляОтбораФактур.Добавить(Справочники.Фактура.ПустаяСсылка());
//	//КонецЕсли;	
//	
//	Если НЕ СтруктураПараметров = Неопределено Тогда
//		СтруктураПараметров.Вставить("ДатаОтчета", 					Отчет.Дата);
//		СтруктураПараметров.Вставить("СписокВидовЦен", 				СписокВидовЦен);
//		СтруктураПараметров.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
//		СтруктураПараметров.Вставить("СписокДляОтбораФактур", 			СписокДляОтбораФактур);
//		СтруктураПараметров.Вставить("Валюта", 					Отчет.Валюта);
//		СтруктураПараметров.Вставить("ПоказыватьНулевыеЦены", 		Отчет.ПоказыватьНулевыеЦены);
//		СтруктураПараметров.Вставить("ВидНоменклатурыПотолки",		Отчет.ВидНоменклатурыПотолки);
//		СтруктураПараметров.Вставить("ПоказыватьАрхивныеПозиции", 	Отчет.ПоказыватьАрхивныеПозиции);
//		СтруктураПараметров.Вставить("ГруппировкаПоФактуре", 		Отчет.ГруппировкаПоФактуре);
//		СтруктураПараметров.Вставить("ГруппировкаПоГруппеФактур", 	Отчет.ГруппировкаПоГруппеФактур);
//	КонецЕсли;

//КонецПроцедуры

#Область ЦеныУслугПроизводства

#КонецОбласти

&НаКлиенте
Процедура ПрайсТоварыМатериалыУслугиПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсПотолкиПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсПроизводственныеУслугиНаПотолкиПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсОтрезыПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПрайсПроизводствееныеУслугиНаОтрезыПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВидыИндивидуальныхЦенПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальныеЦеныПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВидыИндивидуальныхЦенВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыИндивидуальныхЦенКонтрагентПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВидыИндивидуальныхЦен.ТекущиеДанные;
	ТекущиеДанные.ДоговорКонтрагента = ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Контрагент, "ОсновнойДоговор");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ВидыИндивидуальныхЦен.Видимость = Отчет.ИндивидуальныеЦены;
	
	//Товары и услуги
	Элементы.ГруппаНастройкиТоварыМатериалыУслуги.Видимость = Отчет.ПрайсТоварыМатериалыУслуги;
	Элементы.ГруппаОтборНоменклатуры.Видимость = Отчет.ПрайсТоварыМатериалыУслуги;
	//Потолки
	Элементы.ГруппаНастройкиПотолки.Видимость = Отчет.ПрайсПотолки;	
	//Производственные услуги
	Элементы.ГруппаПроизводственныеУслуги.Видимость = Отчет.ПрайсПроизводственныеУслугиНаПотолки;
	//Отрезы
	Элементы.ГруппаОтрезы.Видимость = Отчет.ПрайсОтрезы;
	//Производственные услуги на отрезы
	Элементы.ГруппаПроизводственныеУслугиОтрезы.Видимость = Отчет.ПрайсПроизводственныеУслугиНаОтрезы;
	//Потолки и отрезы
	Элементы.ГруппаОтборФактуры.Видимость = (Отчет.ПрайсПотолки ИЛИ Отчет.ПрайсОтрезы);
	
КонецПроцедуры
